package org.chudnovskiy0;

/**
 *
 Реализовать базу данных налоговой инспекции по штрафам. Идентифицировать конкретного человека бу-
 дет его персональный идентификационный код. У одного человека может быть много штрафов.
 Реализовать:
 1. Полная распечатка базы данных.
 2. Распечатка данных по конкретному коду.
 3. Распечатка данных по конкретному типу штрафа.
 4. Распечатка данных по конкретному городу.
 5. Добавление нового человека с информацией о нем.
 6. Добавление новых штрафов для уже существующей записи.
 7. Удаление штрафа.
 8. Замена информации о человеке и его штрафах.

 */
public class App {
}
