package org.chudnovskiy0;

public enum FineData {
    ST_117("Нарушение установленного порядка взятия на учет (регистрации) в контролирующих органах ( ст. 117 НКУ)", 100),
    ST_119("Нарушение порядка подачи информации о физлицах ( ст. 119 НКУ)", 220),
    ST_120("Непредоставление или несвоевременное предоставление налоговой отчетности, несоблюдение требований по «самоисправлению» ( ст. 120 НКУ)", 510),
    ST_1201_1("Просрочка регистрации НН/РК в ЕРНН ( п. 1201.1 НКУ)", 340),
    ST_120_2("Отсутствие регистрации НН/РК в ЕРНН ( п. 1201.2 НКУ)", 720),
    ST_1201_3("Ошибки в обязательных реквизитах НН ( п. 1201.3 НКУ)", 610),
    ST_1202("Нарушение порядка регистрации акцизных накладных и РК к таким АН в ЕРАН ( ст. 1202 НКУ)", 710),
    ST_121("Нарушение сроков хранения учетных документов ( ст. 121 НКУ)", 1200);

    public final String label;
    public final int value;

    FineData(String label, int value) {
        this.label = label;
        this.value = value;
    }

    @Override
    public String toString() {
        return this.label;
    }
}
